EntroMorphic/reflex-os/sdkconfig.defaults.independence
CONFIG_IDF_TARGET="esp32c6"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="4MB"
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"
CONFIG_ULP_COPROC_ENABLED=y
CONFIG_ULP_COPROC_TYPE_LP_CORE=y
CONFIG_ULP_COPROC_RESERVE_MEM=2048

CONFIG_REFLEX_KERNEL_SCHEDULER=y

# The independence path: the radio with no Wi-Fi blob, which is what
# docs/independence-dependency-map.md and tools/check_independence.py both
# measure. It is not the default backend, so before this file existed the
# configuration every independence claim refers to had no build recipe.
CONFIG_REFLEX_RADIO_802154=y

# Coexistence off: this configuration runs 802.15.4 alone.
#
# libcoexist.a is a binary blob, and it is 27 of the image's 42 blob symbols and
# 10,130 bytes of it. Measured: with coex compiled out the radio initialises,
# reports the right channel and PAN ID, and transmits — but receives nothing,
# twice, against a live peer. The entire difference is the COEX_PTI register:
# ieee802154_ll_disable_coex() writes pti=1/hw_ack=1, the blob writes pti=3/
# hw_ack=8, and writing the latter by hand brought reception straight back.
# reflex_radio_802154.c now programs it, so the blob is not needed here.
#
# Only valid because nothing else uses the radio; the same file refuses this
# combination at compile time if Wi-Fi is also enabled.
CONFIG_ESP_COEX_SW_COEXIST_ENABLE=n
